a = int(input("Введите число: "))
if 0 <= a < 8640000:
    if a // 60 != a / 60 and a < 3600:
        b = a // 3600
        c = a % 60
    elif a // 3600 != a / 3600 and 3600 < a < 86400:
        d = a // 3600
        b = (a - d * 3600) // 60
        c = a % 3600
    elif a // 86400 != a / 86400 and a > 86400:
        t = a // 86400
        d = (a - t * 86400) // 3600
        b = (a -  d * 3600) // 60
        c = a % 86400

print(t, "день")
print(d, "час")
print(b, "минута")
print(c, "секунда")

# 60 сек = 1 мин
# 3600 сек = 60 мин = 1 час
# 86400 сек = 1440 мин = 24 часа = 1 день
